org/CS/os.org
#+TITLE: Computer Systems
#+KEYWORDS: OS
#+OPTIONS: H:3 toc:3 num:3 ^:nil
#+SETUPFILE: ../configOrg/level1.org
#+LaTeX: t
* Represeting Infomation
** Integer
*** Integer Limits
$$TMax_w = 2^{w-1}-1\quad TMin_w = - 2^{w-1}\quad UMax_w = 2^w-1\quad UMin_w = 0$$
*** Binary2Integer
$$B2U_w(\overrightarrow{x})\doteq\sum_{i=0}^{w-1}x_i2^i$$
***** Twos' Complement
$$B2T_w(\overrightarrow{x})\doteq-x_{w-1}2^{w-1}+\sum_{i=0}^{w-2}x_i2^i$$
**** extension
***** Ones' Complement
$$B2O_w(\overrightarrow{x})\doteq-x_{w-1}(2^{w-1}-1)+\sum_{i=0}^{w-2}x_i2^i$$
***** Sign-Magnitude
$$B2S_w(\overrightarrow{x})\doteq(-1)^{x_{w-1}}\cdot(\sum_{i=0}^{w-2}x_i2^i)$$
*** Transform between signed and unsigned
**** $T2U_w(x)$
$$B2U_w(\overrightarrow{x})-B2T_w(\overrightarrow{x})=x_{w-1}(2^{w-1}--2^{w-1})=x_{w-1}2^w$$
Let $\overrightarrow{x}=T2B_w(x)$ , Then：
$$B2U_w(T2B_w(x)) = x_{w-1}2^w + B2T_w(T2B_w(x)) = x_{w-1}2^w + x=T2U_w(x)$$
bit $x_{w-1}$ is the sign bit, giving:
\[ T2U_w(x) = \left\{ 
  \begin{array}{l l}
    x+2^w & \quad x<0\\
    x & \quad x\geq0
  \end{array} \right.\]
**** $U2T_w(x)$
$$U2T_w(u)=B2T_w(U2B_w(u))=-u_{w-1}2^w+u$$
\[ U2T_w(u) = \left\{
  \begin{array}{l l}
    u & \quad u<2^{w-1}\\
    u - 2^w & \quad u\ge2^{w-1}
   \end{array} \right.\]
**** Use in C
***** Small size to big size 
- unsigned:  zero extension(add zero on the left side)
- signed:  sign extension(add sign value on the left side)
  $$B2T_{w+1}([x_{w-1},x_{w-1},x_{w-2},\cdots,x_0])=-x_{w-1}2^w+\sum_{i=0}^{w-1}x_i2^i$$
  $$=-x_{w-1}2^{w-1}+\sum_{i=0}^{w-2}x_i2^i$$
  $$=B2T_w([x_{w-1},x_{w-2},\cdots,x_0])$$
***** Convert from short 2 unsigned int
1) Change the size
2) Convert from signed to unsigned
***** Big size to small size
Truncate high bits by mod $2^k$
$$B2U_w([x_{w-1},x_{w-2},\cdots,x_0])\mod 2^k=[\sum_{i=0}^{w-1}x_i2^i]\mod 2^k$$
$$=[\sum_{i=0}^{k-1}x_i2^i] \mod 2^k = \sum_{i=0}^{k-1}x_i2^i$$
$$= B2U_k([x_{k-1},x_{k-2},\cdots,x_0])$$
Note that: 
1) $2^i \mod 2^k = 0 \text{ for any }i \ge k$
2) $\sum_{i=0}^{k-1}x_i2^i\le\sum_{i=0}^{k-1}2^i=2^k-1<2^k$

For two's-complement numbers:
$$B2T_k([x_{k-1}, x_{k-2}, \cdots, x_0])=U2T_k(B2U_w([x_{w-1},x_{w-2},\cdots,x_0])\mod 2^k)$$
*** Summary
- $$B2U_w(\overrightarrow{x})\doteq\sum_{i=0}^{w-1}x_i2^i$$
- $$B2T_w(\overrightarrow{x})\doteq-x_{w-1}2^{w-1}+\sum_{i=0}^{w-2}x_i2^i$$
- \[ T2U_w(x) = \left\{ 
  \begin{array}{l l}
    x+2^w & \quad x<0\\
    x & \quad x\geq0
  \end{array} \right.\]
- \[ U2T_w(u) = \left\{
  \begin{array}{l l}
    u & \quad u<2^{w-1}\\
    u - 2^w & \quad u\ge2^{w-1}
   \end{array} \right.\]
- Unsigned big2small：$B2U_k([x_{k-1},x_{k-2},\cdots,x_0])=B2U_w([x_{w-1},x_{w-2},\cdots,x_0])\mod 2^k$
- Signed big2small：$B2T_k([x_{k-1}, x_{k-2}, \cdots, x_0])=U2T_k(B2U_k([x_{k-1},x_{k-2},\cdots,x_0])$
*** Extension
Consider following code:
#+begin_src c
short sx = -12345;
unsigned int uy = sx;//unknow result
#+end_src
C standards: 
1) Change the size, short 2 int
2) signed 2 unsigned
** Floating Point
*** Fractional Binary Numbers
- Fractional Decimal
$$d=\sum_{i=-n}^m10^i\times{d_i}$$
Consider Fractional decimal $12.34_{10}$
$$ 1\times{10^1} + 2\times{10^0} + 3\times{10^{-1}} + 4\times{10^{-2}}=12\frac{34}{100}$$
- Fractional Binary
$$b=\sum_{i=-n}^m2^i\times{b_i}$$
eg:  $101.11_2$
$$ 1\times{2^2} + 0\times{2^1} + 1\times{2^0} + 1\times{2^{-1}} + 1\times{2^{-2}} = 5\frac{3}{4}$$
*** IEEE Floating-Point
$$V=(-1)^{s}\times{M}\times{2^E}$$
- sign s: negative(s=1) positive(s=0)
- significand M: a fractional binary number
- exponent E: weights the value by a power of 2
#+BEGIN_VERSE
Three fields represent: 1-bit s, k-bit exp(encode E), n-bit frac(encode M) 
Using in C:
float(single-precision) s=1, k=8, n=23 yielding a 32-bit representation
double(double-precision) s=1, k=11, n=52, yielding a 64-bit representation
#+END_VERSE
**** Nomalized Values
#+BEGIN_VERSE
Condition: exp is not all zeros(0) & not all ones(255 for single, 2047 for double)

Cal: 
E=e-Bias
e is the unsigned number having bit representation $e_{k-1}...e_1e_0$
Bias is bias value equal to $2^{k-1}-1$ (127 for single 1023 for double)
Hance, $-126\leq{E}\leq{+127}$ for single $-1022\leq{E}\leq{+1023}$ for double
M=1+f 
where $0\leq{f}<1$ having binary representation $0.f_{n-1}...f_1f_0$
so that, M is in the range $1\leq{M}<2$
This implied leading 1 is a trick for getting an additional bit of precision for free.
#+END_VERSE
**** Denormalized Values
#+BEGIN_VERSE
Condition: exp is all zeros
Cal: E=1-Bias, M=f
Serve two purposes:
#+END_VERSE
- represent 0 (all bits are zero)
- represent numbers that are very close to 0.0
