CS/os.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Operating Systems</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="Operating Systems"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2014-05-04T14:00+0800"/>
<meta name="author" content="ChrisChen"/>
<meta name="description" content=""/>
<meta name="keywords" content="OS"/>
<link rel="stylesheet" href="../css/stylesheet.css" type="text/css"/>
</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:100%;white-space:nowrap;">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>


<div id="content">
<h1 class="title">Operating Systems</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Represeting Infomation</a>
<ul>
<li><a href="#sec-1-1">1.1 Integer</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 Integer Limits</a></li>
<li><a href="#sec-1-1-2">1.1.2 Binary2Integer</a></li>
<li><a href="#sec-1-1-3">1.1.3 Transform between signed and unsigned</a></li>
<li><a href="#sec-1-1-4">1.1.4 Summary</a></li>
<li><a href="#sec-1-1-5">1.1.5 Extension</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 Floating Point</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 Fractional Binary Numbers</a></li>
<li><a href="#sec-1-2-2">1.2.2 IEEE Floating-Point</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-2">2 Manipulating Infomation</a>
<ul>
<li><a href="#sec-2-1">2.1 Integer arithmatic</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1 Unsigned Addition</a></li>
<li><a href="#sec-2-1-2">2.1.2 Unsigned Negation</a></li>
<li><a href="#sec-2-1-3">2.1.3 Two's Complement Addition</a></li>
<li><a href="#sec-2-1-4">2.1.4 Two's Complement Negation</a></li>
<li><a href="#sec-2-1-5">2.1.5 Unsigned Mutliplication</a></li>
<li><a href="#sec-2-1-6">2.1.6 Two's Complement Multiplication</a></li>
<li><a href="#sec-2-1-7">2.1.7 Reduce Mutiplication by shift and addition</a></li>
<li><a href="#sec-2-1-8">2.1.8 Reduce Division by shift</a></li>
</ul>
</li>
<li><a href="#sec-2-2">2.2 Floating Operation</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1 Round</a></li>
<li><a href="#sec-2-2-2">2.2.2 Arithmatic Operation</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-3">3 Program Structure</a>
<ul>
<li><a href="#sec-3-1">3.1 Data Formats</a></li>
<li><a href="#sec-3-2">3.2 Interger Registers</a></li>
<li><a href="#sec-3-3">3.3 Accessing Information</a></li>
<li><a href="#sec-3-4">3.4 Basic Operations</a>
<ul>
<li><a href="#sec-3-4-1">3.4.1 Data Movement</a></li>
<li><a href="#sec-3-4-2">3.4.2 Arithmetic &amp; Logical Operations</a></li>
<li><a href="#sec-3-4-3">3.4.3 About xorl x, x</a></li>
<li><a href="#sec-3-4-4">3.4.4 Special Arithmetic Operations</a></li>
</ul>
</li>
<li><a href="#sec-3-5">3.5 Control</a>
<ul>
<li><a href="#sec-3-5-1">3.5.1 Condiction Register</a></li>
<li><a href="#sec-3-5-2">3.5.2 Accessing the Condition Codes</a></li>
<li><a href="#sec-3-5-3">3.5.3 Jump Instruction</a></li>
<li><a href="#sec-3-5-4">3.5.4 If Statement</a></li>
<li><a href="#sec-3-5-5">3.5.5 Loops</a></li>
<li><a href="#sec-3-5-6">3.5.6 Conditional Move Instructions</a></li>
<li><a href="#sec-3-5-7">3.5.7 Switch Statement</a></li>
</ul>
</li>
<li><a href="#sec-3-6">3.6 Procedure</a>
<ul>
<li><a href="#sec-3-6-1">3.6.1 Stack Frame</a></li>
<li><a href="#sec-3-6-2">3.6.2 Procedure Call</a></li>
<li><a href="#sec-3-6-3">3.6.3 Registers</a></li>
<li><a href="#sec-3-6-4">3.6.4 Example</a></li>
</ul>
</li>
<li><a href="#sec-3-7">3.7 Array Allocation</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Represeting Infomation</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Integer</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Integer Limits</h4>
<div class="outline-text-4" id="text-1-1-1">


$$TMax_w = 2^{w-1}-1\quad TMin_w = - 2^{w-1}\quad UMax_w = 2^w-1\quad UMin_w = 0$$
</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Binary2Integer</h4>
<div class="outline-text-4" id="text-1-1-2">


$$B2U_w(\overrightarrow{x})\doteq\sum_{i=0}^{w-1}x_i2^i$$
<ul>
<li id="sec-1-1-2-1">Twos' Complement<br/>
$$B2T_w(\overrightarrow{x})\doteq-x_{w-1}2^{w-1}+\sum_{i=0}^{w-2}x_i2^i$$
</li>
</ul>
<ul>
<li id="sec-1-1-2-1">extension<br/>
<ul>
<li id="sec-1-1-2-1-1">Ones' Complement<br/>
$$B2O_w(\overrightarrow{x})\doteq-x_{w-1}(2^{w-1}-1)+\sum_{i=0}^{w-2}x_i2^i$$
</li>
</ul>
<ul>
<li id="sec-1-1-2-1-2">Sign-Magnitude<br/>
$$B2S_w(\overrightarrow{x})\doteq(-1)^{x_{w-1}}\cdot(\sum_{i=0}^{w-2}x_i2^i)$$
</li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Transform between signed and unsigned</h4>
<div class="outline-text-4" id="text-1-1-3">

<ul>
<li id="sec-1-1-3-1">\(T2U_w(x)\)<br/>
$$B2U_w(\overrightarrow{x})-B2T_w(\overrightarrow{x})=x_{w-1}(2^{w-1}--2^{w-1})=x_{w-1}2^w$$
Let \(\overrightarrow{x}=T2B_w(x)\) , Then：
$$B2U_w(T2B_w(x)) = x_{w-1}2^w + B2T_w(T2B_w(x)) = x_{w-1}2^w + x=T2U_w(x)$$
bit \(x_{w-1}\) is the sign bit, giving:
\[ T2U_w(x) = \left\{ 
  \begin{array}{l l}
    x+2^w & \quad x<0\\
    x & \quad x\geq0
  \end{array} \right.\]
</li>
</ul>
<ul>
<li id="sec-1-1-3-2">\(U2T_w(x)\)<br/>
$$U2T_w(u)=B2T_w(U2B_w(u))=-u_{w-1}2^w+u$$
\[ U2T_w(u) = \left\{
  \begin{array}{l l}
    u & \quad u<2^{w-1}\\
    u - 2^w & \quad u\ge2^{w-1}
   \end{array} \right.\]
</li>
</ul>
<ul>
<li id="sec-1-1-3-3">Use in C<br/>
<ul>
<li id="sec-1-1-3-3-1">Small size to big size<br/>
<ul>
<li>unsigned:  zero extension(add zero on the left side)
</li>
<li>signed:  sign extension(add sign value on the left side)
  $$B2T_{w+1}([x_{w-1},x_{w-1},x_{w-2},\cdots,x_0])=-x_{w-1}2^w+\sum_{i=0}^{w-1}x_i2^i$$
  $$=-x_{w-1}2^{w-1}+\sum_{i=0}^{w-2}x_i2^i$$
  $$=B2T_w([x_{w-1},x_{w-2},\cdots,x_0])$$
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-1-3-3-2">Convert from short 2 unsigned int<br/>
<ol>
<li>Change the size
</li>
<li>Convert from signed to unsigned
</li>
</ol>

</li>
</ul>
<ul>
<li id="sec-1-1-3-3-3">Big size to small size<br/>
Truncate high bits by mod \(2^k\)
$$B2U_w([x_{w-1},x_{w-2},\cdots,x_0])\mod 2^k=[\sum_{i=0}^{w-1}x_i2^i]\mod 2^k$$
$$=[\sum_{i=0}^{k-1}x_i2^i] \mod 2^k = \sum_{i=0}^{k-1}x_i2^i$$
$$= B2U_k([x_{k-1},x_{k-2},\cdots,x_0])$$
Note that: 
<ol>
<li>\(2^i \mod 2^k = 0 \text{ for any }i \ge k\)
</li>
<li>\(\sum_{i=0}^{k-1}x_i2^i\le\sum_{i=0}^{k-1}2^i=2^k-1&lt;2^k\)
</li>
</ol>


<p>
For two's-complement numbers:
$$B2T_k([x_{k-1}, x_{k-2}, \cdots, x_0])=U2T_k(B2U_w([x_{w-1},x_{w-2},\cdots,x_0])\mod 2^k)$$
</p></li>
</ul>
</li>
</ul>
</div>

</div>

<div id="outline-container-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> Summary</h4>
<div class="outline-text-4" id="text-1-1-4">

<ul>
<li>$$B2U_w(\overrightarrow{x})\doteq\sum_{i=0}^{w-1}x_i2^i$$
</li>
<li>$$B2T_w(\overrightarrow{x})\doteq-x_{w-1}2^{w-1}+\sum_{i=0}^{w-2}x_i2^i$$
</li>
<li>\[ T2U_w(x) = \left\{ 
  \begin{array}{l l}
    x+2^w & \quad x<0\\
    x & \quad x\geq0
  \end{array} \right.\]
</li>
<li>\[ U2T_w(u) = \left\{
  \begin{array}{l l}
    u & \quad u<2^{w-1}\\
    u - 2^w & \quad u\ge2^{w-1}
   \end{array} \right.\]
</li>
<li>Unsigned big2small：\(B2U_k([x_{k-1},x_{k-2},\cdots,x_0])=B2U_w([x_{w-1},x_{w-2},\cdots,x_0])\mod 2^k\)
</li>
<li>Signed big2small：\(B2T_k([x_{k-1}, x_{k-2}, \cdots, x_0])=U2T_k(B2U_k([x_{k-1},x_{k-2},\cdots,x_0])\)
</li>
</ul>

</div>

</div>

<div id="outline-container-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> Extension</h4>
<div class="outline-text-4" id="text-1-1-5">

<p>Consider following code:
</p>


<pre class="src src-c"><span style="color: #daa520;">short</span> <span style="color: #008b8b;">sx</span> = -12345;
<span style="color: #daa520;">unsigned</span> <span style="color: #daa520;">int</span> <span style="color: #008b8b;">uy</span> = sx;<span style="color: #8b8989;">//</span><span style="color: #8b8989;">unknow result</span>
</pre>

<p>
C standards: 
</p><ol>
<li>Change the size, short 2 int
</li>
<li>signed 2 unsigned
</li>
</ol>

</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Floating Point</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Fractional Binary Numbers</h4>
<div class="outline-text-4" id="text-1-2-1">

<ul>
<li>Fractional Decimal
</li>
</ul>


$$d=\sum_{i=-n}^m10^i\times{d_i}$$
<p>
Consider Fractional decimal \(12.34_{10}\)
$$ 1\times{10^1} + 2\times{10^0} + 3\times{10^{-1}} + 4\times{10^{-2}}=12\frac{34}{100}$$
</p><ul>
<li>Fractional Binary
</li>
</ul>


$$b=\sum_{i=-n}^m2^i\times{b_i}$$
<p>
eg:  \(101.11_2\)
$$ 1\times{2^2} + 0\times{2^1} + 1\times{2^0} + 1\times{2^{-1}} + 1\times{2^{-2}} = 5\frac{3}{4}$$
</p></div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> IEEE Floating-Point</h4>
<div class="outline-text-4" id="text-1-2-2">


$$V=(-1)^{s}\times{M}\times{2^E}$$
<ul>
<li>sign s: negative(s=1) positive(s=0)
</li>
<li>significand M: a fractional binary number
</li>
<li>exponent E: weights the value by a power of 2
</li>
</ul>


<p class="verse">
Three fields represent: 1-bit s, k-bit exp(encode E), n-bit frac(encode M) <br/>
Using in C:<br/>
float(single-precision) s=1, k=8, n=23 yielding a 32-bit representation<br/>
double(double-precision) s=1, k=11, n=52, yielding a 64-bit representation<br/>
</p>


<ul>
<li id="sec-1-2-2-1">Nomalized Values<br/>

<p class="verse">
Condition: exp is not all zeros(0) &amp; not all ones(255 for single, 2047 for double)<br/>
<br/>
Cal: <br/>
E=e-Bias<br/>
e is the unsigned number having bit representation \(e_{k-1}...e_1e_0\)<br/>
Bias is bias value equal to \(2^{k-1}-1\) (127 for single 1023 for double)<br/>
Hance, \(-126\leq{E}\leq{+127}\) for single \(-1022\leq{E}\leq{+1023}\) for double<br/>
M=1+f <br/>
where \(0\leq{f}&lt;1\) having binary representation \(0.f_{n-1}...f_1f_0\)<br/>
so that, M is in the range \(1\leq{M}&lt;2\)<br/>
This implied leading 1 is a trick for getting an additional bit of precision for free.<br/>
</p>


</li>
</ul>
<ul>
<li id="sec-1-2-2-2">Denormalized Values<br/>

<p class="verse">
Condition: exp is all zeros<br/>
Cal: E=1-Bias, M=f<br/>
Serve two purposes:<br/>
</p>


<ul>
<li>represent 0 (all bits are zero)
</li>
<li>represent numbers that are very close to 0.0
</li>
</ul>

</li>
</ul>
<ul>
<li id="sec-1-2-2-3">Spacial Values<br/>

<p class="verse">
