org/CS/os.org
**** Spacial Values
#+BEGIN_VERSE
Condition: exp is all ones
#+END_VERSE
- frac is all zeros: represent infinity, infinity represent operation overflow or divide by zero.
- frac is nonzero: resulting value called "NaN"(Not a number)
#+BEGIN_VERSE
When the result can not be given as a real number or as a infinity, use NaN or inf
eg: 
$\sqrt{-1}:  NaN$ 
$1.0/0.0:  +\infty$
#+END_VERSE

**** Examples
8-bit floating-point format
| Description      | bits       |  e |  E | $2^E$          | f             | M              | $2^E\times{M}$   | V               |  Decimal |
|------------------+------------+----+----+----------------+---------------+----------------+------------------+-----------------+----------|
| Zero             | 0 0000 000 |  0 | -6 | $\frac{1}{64}$ | $\frac{0}{8}$ | $\frac{0}{8}$  | $\frac{0}{512}$  | 0               |      0.0 |
| Smallest pos. | 0 0000 001 |  0 | -6 | $\frac{1}{64}$ | $\frac{1}{8}$ | $\frac{1}{8}$  | $\frac{1}{512}$  | $\frac{1}{512}$ | 0.001953 |
| Largest denorm.  | 0 0000 111 |  0 | -6 | $\frac{1}{64}$ | $\frac{7}{8}$ | $\frac{7}{8}$  | $\frac{7}{512}$  | $\frac{7}{512}$ | 0.005859 |
| Smallest norm.   | 0 0001 000 |  1 | -6 | $\frac{1}{64}$ | $\frac{0}{8}$ | $\frac{8}{8}$  | $\frac{8}{512}$  | $\frac{1}{64}$  | 0.013672 |
| One              | 0 0111 000 |  7 |  0 | 1              | $\frac{0}{8}$ | $\frac{8}{8}$  | $\frac{8}{8}$    | 1               |      1.0 |
| Largest norm.    | 0 1110 111 | 14 |  7 | 128            | $\frac{7}{8}$ | $\frac{15}{8}$ | $\frac{1920}{8}$ | 240             |    240.0 |
| Infinity         | 0 1111 000 |  - |  - | -              | -             | -              | -                | $\infty$        |        - |

* Manipulating Infomation
** Integer arithmatic 
*** Unsigned Addition
\[ x+^u_wy= \left\{
  \begin{array}{l l}
    x+y & \quad x+y<2^w\\
    x+y-2^w & \quad 2^w\le x+y<2^{w-1}
   \end{array} \right.\]
Equals,  $x+^u_wy=(x+y) \mod 2^w$
#+BEGIN_VERSE
When overflow occured, $sum=x+y-2^w$
Because $y < 2^w$
We have $sum = x +(y-2^w) < x$
sum < x means it did overflow.
#+END_VERSE
*** Unsigned Negation
\[ -^u_wx= \left\{
  \begin{array}{l l}
    x & \quad x=0\\
    2^w-x & \quad x>0
   \end{array} \right.\]
*** Two's Complement Addition
1) from signed operand to unsigned
2) excute unsigned addition(truncate the overflow)
$$x+^t_wy\doteq U2T_w(T2U_w(x)+^u_wT2U_w(y))$$
$$=U2T_w[(x_{w-1}2^w+x+y_{w-1}2^w+y) \mod 2^w]$$
\[ x+^t_wy= \left\{
  \begin{array}{l l}
    x+y-2^w & \qquad x+y\ge 2^{w-1} \quad Positive \ overflow\\
    x+y & \qquad -2^{w-1}\le x+y<2^{w-1} \quad Normal\\
    x+y+2^w & \qquad x+y<-2^{w-1} \quad Negative \ overflow
   \end{array} \right.\]
Example:
|      $x$ |      $y$ |      $x+y$ | $x+^t_4y$ |
|----------+----------+------------+-----------|
| -8(1000) | -5(1011) | -13(10011) |   3(0011) |
*** Two's Complement Negation
\[ -^t_wx= \left\{
  \begin{array}{l l}
    -2^{w-1} & \qquad x=-2^{w-1} \\
    -x & \qquad x>-2^{w-1} \\
   \end{array} \right.\]
Two Clever Ways:
**** One Way
1) complement the bits
2) increment by 1
|       x |       ~x | incr(~x) |
|---------+----------+----------|
| 0101(5) | 1010(-6) | 1011(-5) |
**** Another Way
Condition: $x\neq 0$
1) Split the bit vector into two parts.(the boundary is the rightmost 1)
2) Complement each bit on the left part.
| x | -x |
|---+----|
| 1 /100/ (-4) | 0 /100/ (4) |
*** Unsigned Mutliplication
#+BEGIN_VERSE
Range: $0\le x,y\le 2^{w-1}$ Hence $0\le x\cdot y\le2^{2w}-2^{w+1}+1$
This could require as many as 2w bits to represent.
#+END_VERSE
$$ x \times ^u_wy=(x\cdot y)\ mod\ 2^w$$
*** Two's Complement Multiplication
#+BEGIN_VERSE
Range: $-2^{w-1}\le x,y \le 2^{w-1}-1$ 
Hence:
The result of $x\cdot y$ is $-2^{w-1}\cdot (2^{w-1}-1)=-2^{2w-2}+2^{w-1}$ between $2^{2w-2}=-2^{w-1}\cdot -2^{w-1}$
Also need 2w bits to represent.
#+END_VERSE
$$ x \times ^t_wy = U2T_w((x\cdot y)\ mod\ 2^w) $$
**** Extension
#+BEGIN_VERSE
The bit-level representation of the product operation is identical for both unsigned and two's complement multiplication.
#+END_VERSE
Let :
$$x = B2U(\overrightarrow{x})\quad y = B2U(\overrightarrow{y})\quad x' = B2T(\overrightarrow{x})\quad y' = B2T(\overrightarrow{y})$$
Then we have : 
$$x' = x-x_{w-1}2^w\quad y' = y-y_{w-1}2^w$$
Result:
$$(x'\cdot y')\ mod\ 2^w = ((x - x_{w-1}2^w)\cdot (y - y_{w-1}2^w))\ mod\ 2$$
$$=(x\cdot y)\ mod\ 2^w$$

*** Reduce Mutiplication by shift and addition
Mutiplication require 10 or more clock cycles.
$$ x \times ^t_w2^k  = x << k$$
eg: $14 = 2^4-2^1$ rewrite as $(x<<4) - (x <<1)$
#+BEGIN_VERSE
For continuous 1s from bit position n down to m($n/beqm$), we can compute using two forms:
Form1: $(x<<n) + (x<<n-1) + ... + (x<<m)$
Form2: $(x<<n+1)-(x<<m)$

Assuming additions and subtractions have comparable cost, then we have:
$n = m$, use Form1.
$n = m+1$, use either Form1 or Form2.
$n > m+1$, use Form2.
#+END_VERSE
*** Reduce Division by shift
Division require 30 or more clock cycles.
**** Logical Shift
$x>>k = x\div2^k$ where $0\le{k}<w$ and $x\ge0$
**** Arithmatic Shift
$x>>k = x\div2^k$ where $0\le{k}<w$
#+BEGIN_VERSE
Follow the above, we'll find -7/2 yield -4 not -3.
Correct by 'biasing' the value before shifting.
#+END_VERSE
$x\div 2^k = (x+2^k-1)>>k$ where $x<0$
** Floating Operation
