CS/os.html
Condition: exp is all ones<br/>
</p>


<ul>
<li>frac is all zeros: represent infinity, infinity represent operation overflow or divide by zero.
</li>
<li>frac is nonzero: resulting value called "NaN"(Not a number)
</li>
</ul>


<p class="verse">
When the result can not be given as a real number or as a infinity, use NaN or inf<br/>
eg: <br/>
\(\sqrt{-1}:  NaN\) <br/>
\(1.0/0.0:  +\infty\)
</p>


</li>
</ul>
<ul>
<li id="sec-1-2-2-4">Examples<br/>
8-bit floating-point format
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="right" /><col class="right" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Description</th><th scope="col" class="left">bits</th><th scope="col" class="right">e</th><th scope="col" class="right">E</th><th scope="col" class="left">\(2^E\)</th><th scope="col" class="left">f</th><th scope="col" class="left">M</th><th scope="col" class="left">\(2^E\times{M}\)</th><th scope="col" class="left">V</th><th scope="col" class="right">Decimal</th></tr>
</thead>
<tbody>
<tr><td class="left">Zero</td><td class="left">0 0000 000</td><td class="right">0</td><td class="right">-6</td><td class="left">\(\frac{1}{64}\)</td><td class="left">\(\frac{0}{8}\)</td><td class="left">\(\frac{0}{8}\)</td><td class="left">\(\frac{0}{512}\)</td><td class="left">0</td><td class="right">0.0</td></tr>
<tr><td class="left">Smallest pos.</td><td class="left">0 0000 001</td><td class="right">0</td><td class="right">-6</td><td class="left">\(\frac{1}{64}\)</td><td class="left">\(\frac{1}{8}\)</td><td class="left">\(\frac{1}{8}\)</td><td class="left">\(\frac{1}{512}\)</td><td class="left">\(\frac{1}{512}\)</td><td class="right">0.001953</td></tr>
<tr><td class="left">Largest denorm.</td><td class="left">0 0000 111</td><td class="right">0</td><td class="right">-6</td><td class="left">\(\frac{1}{64}\)</td><td class="left">\(\frac{7}{8}\)</td><td class="left">\(\frac{7}{8}\)</td><td class="left">\(\frac{7}{512}\)</td><td class="left">\(\frac{7}{512}\)</td><td class="right">0.005859</td></tr>
<tr><td class="left">Smallest norm.</td><td class="left">0 0001 000</td><td class="right">1</td><td class="right">-6</td><td class="left">\(\frac{1}{64}\)</td><td class="left">\(\frac{0}{8}\)</td><td class="left">\(\frac{8}{8}\)</td><td class="left">\(\frac{8}{512}\)</td><td class="left">\(\frac{1}{64}\)</td><td class="right">0.013672</td></tr>
<tr><td class="left">One</td><td class="left">0 0111 000</td><td class="right">7</td><td class="right">0</td><td class="left">1</td><td class="left">\(\frac{0}{8}\)</td><td class="left">\(\frac{8}{8}\)</td><td class="left">\(\frac{8}{8}\)</td><td class="left">1</td><td class="right">1.0</td></tr>
<tr><td class="left">Largest norm.</td><td class="left">0 1110 111</td><td class="right">14</td><td class="right">7</td><td class="left">128</td><td class="left">\(\frac{7}{8}\)</td><td class="left">\(\frac{15}{8}\)</td><td class="left">\(\frac{1920}{8}\)</td><td class="left">240</td><td class="right">240.0</td></tr>
<tr><td class="left">Infinity</td><td class="left">0 1111 000</td><td class="right">-</td><td class="right">-</td><td class="left">-</td><td class="left">-</td><td class="left">-</td><td class="left">-</td><td class="left">\(\infty\)</td><td class="right">-</td></tr>
</tbody>
</table>


</li>
</ul>
</div>
</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Manipulating Infomation</h2>
<div class="outline-text-2" id="text-2">


</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Integer arithmatic</h3>
<div class="outline-text-3" id="text-2-1">


</div>

<div id="outline-container-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> Unsigned Addition</h4>
<div class="outline-text-4" id="text-2-1-1">


\[ x+^u_wy= \left\{
  \begin{array}{l l}
    x+y & \quad x+y<2^w\\
    x+y-2^w & \quad 2^w\le x+y<2^{w-1}
   \end{array} \right.\]
<p>
Equals,  \(x+^u_wy=(x+y) \mod 2^w\)
</p>
<p class="verse">
When overflow occured, \(sum=x+y-2^w\)<br/>
Because \(y &lt; 2^w\)<br/>
We have \(sum = x +(y-2^w) &lt; x\)<br/>
sum &lt; x means it did overflow.<br/>
</p>


</div>

</div>

<div id="outline-container-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Unsigned Negation</h4>
<div class="outline-text-4" id="text-2-1-2">


\[ -^u_wx= \left\{
  \begin{array}{l l}
    x & \quad x=0\\
    2^w-x & \quad x>0
   \end{array} \right.\]
</div>

</div>

<div id="outline-container-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> Two's Complement Addition</h4>
<div class="outline-text-4" id="text-2-1-3">

<ol>
<li>from signed operand to unsigned
</li>
<li>excute unsigned addition(truncate the overflow)
</li>
</ol>


$$x+^t_wy\doteq U2T_w(T2U_w(x)+^u_wT2U_w(y))$$
$$=U2T_w[(x_{w-1}2^w+x+y_{w-1}2^w+y) \mod 2^w]$$
\[ x+^t_wy= \left\{
  \begin{array}{l l}
    x+y-2^w & \qquad x+y\ge 2^{w-1} \quad Positive \ overflow\\
    x+y & \qquad -2^{w-1}\le x+y<2^{w-1} \quad Normal\\
    x+y+2^w & \qquad x+y<-2^{w-1} \quad Negative \ overflow
   \end{array} \right.\]
<p>
Example:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">\(x\)</th><th scope="col" class="left">\(y\)</th><th scope="col" class="left">\(x+y\)</th><th scope="col" class="left">\(x+^t_4y\)</th></tr>
</thead>
<tbody>
<tr><td class="left">-8(1000)</td><td class="left">-5(1011)</td><td class="left">-13(10011)</td><td class="left">3(0011)</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> Two's Complement Negation</h4>
<div class="outline-text-4" id="text-2-1-4">


\[ -^t_wx= \left\{
  \begin{array}{l l}
    -2^{w-1} & \qquad x=-2^{w-1} \\
    -x & \qquad x>-2^{w-1} \\
   \end{array} \right.\]
<p>
Two Clever Ways:
</p><ul>
<li id="sec-2-1-4-1">One Way<br/>
<ol>
<li>complement the bits
</li>
<li>increment by 1
</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">x</th><th scope="col" class="left">~x</th><th scope="col" class="left">incr(~x)</th></tr>
</thead>
<tbody>
<tr><td class="left">0101(5)</td><td class="left">1010(-6)</td><td class="left">1011(-5)</td></tr>
</tbody>
</table>

</li>
</ul>
<ul>
<li id="sec-2-1-4-2">Another Way<br/>
Condition: \(x\neq 0\)
<ol>
<li>Split the bit vector into two parts.(the boundary is the rightmost 1)
</li>
<li>Complement each bit on the left part.
</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">x</th><th scope="col" class="left">-x</th></tr>
</thead>
<tbody>
<tr><td class="left">1 <i>100</i> (-4)</td><td class="left">0 <i>100</i> (4)</td></tr>
</tbody>
</table>

</li>
</ul>
</div>

</div>

<div id="outline-container-2-1-5" class="outline-4">
<h4 id="sec-2-1-5"><span class="section-number-4">2.1.5</span> Unsigned Mutliplication</h4>
<div class="outline-text-4" id="text-2-1-5">


<p class="verse">
Range: \(0\le x,y\le 2^{w-1}\) Hence \(0\le x\cdot y\le2^{2w}-2^{w+1}+1\)<br/>
This could require as many as 2w bits to represent.<br/>
</p>




$$ x \times ^u_wy=(x\cdot y)\ mod\ 2^w$$
</div>

</div>

<div id="outline-container-2-1-6" class="outline-4">
<h4 id="sec-2-1-6"><span class="section-number-4">2.1.6</span> Two's Complement Multiplication</h4>
<div class="outline-text-4" id="text-2-1-6">


<p class="verse">
Range: \(-2^{w-1}\le x,y \le 2^{w-1}-1\) <br/>
Hence:<br/>
The result of \(x\cdot y\) is \(-2^{w-1}\cdot (2^{w-1}-1)=-2^{2w-2}+2^{w-1}\) between \(2^{2w-2}=-2^{w-1}\cdot -2^{w-1}\)<br/>
Also need 2w bits to represent.<br/>
</p>




$$ x \times ^t_wy = U2T_w((x\cdot y)\ mod\ 2^w) $$
<ul>
<li id="sec-2-1-6-1">Extension<br/>

<p class="verse">
The bit-level representation of the product operation is identical for both unsigned and two's complement multiplication.<br/>
</p>


<p>
Let :
$$x = B2U(\overrightarrow{x})\quad y = B2U(\overrightarrow{y})\quad x' = B2T(\overrightarrow{x})\quad y' = B2T(\overrightarrow{y})$$
Then we have : 
$$x' = x-x_{w-1}2^w\quad y' = y-y_{w-1}2^w$$
Result:
$$(x'\cdot y')\ mod\ 2^w = ((x - x_{w-1}2^w)\cdot (y - y_{w-1}2^w))\ mod\ 2$$
$$=(x\cdot y)\ mod\ 2^w$$

</p></li>
</ul>
</div>

</div>

<div id="outline-container-2-1-7" class="outline-4">
<h4 id="sec-2-1-7"><span class="section-number-4">2.1.7</span> Reduce Mutiplication by shift and addition</h4>
<div class="outline-text-4" id="text-2-1-7">

<p>Mutiplication require 10 or more clock cycles.
$$ x \times ^t_w2^k  = x << k$$
eg: \(14 = 2^4-2^1\) rewrite as \((x&lt;&lt;4) - (x &lt;&lt;1)\)
</p>
<p class="verse">
For continuous 1s from bit position n down to m(\(n/beqm\)), we can compute using two forms:<br/>
Form1: \((x&lt;&lt;n) + (x&lt;&lt;n-1) + ... + (x&lt;&lt;m)\)<br/>
Form2: \((x&lt;&lt;n+1)-(x&lt;&lt;m)\)<br/>
<br/>
Assuming additions and subtractions have comparable cost, then we have:<br/>
\(n = m\), use Form1.<br/>
\(n = m+1\), use either Form1 or Form2.<br/>
\(n &gt; m+1\), use Form2.<br/>
</p>


</div>

</div>

<div id="outline-container-2-1-8" class="outline-4">
<h4 id="sec-2-1-8"><span class="section-number-4">2.1.8</span> Reduce Division by shift</h4>
<div class="outline-text-4" id="text-2-1-8">

<p>Division require 30 or more clock cycles.
</p><ul>
<li id="sec-2-1-8-1">Logical Shift<br/>
\(x&gt;&gt;k = x\div2^k\) where \(0\le{k}&lt;w\) and \(x\ge0\)
</li>
</ul>
<ul>
<li id="sec-2-1-8-2">Arithmatic Shift<br/>
\(x&gt;&gt;k = x\div2^k\) where \(0\le{k}&lt;w\)

<p class="verse">
Follow the above, we'll find -7/2 yield -4 not -3.<br/>
Correct by 'biasing' the value before shifting.<br/>
</p>


<p>
\(x\div 2^k = (x+2^k-1)&gt;&gt;k\) where \(x&lt;0\)
</p></li>
</ul>
</div>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Floating Operation</h3>
<div class="outline-text-3" id="text-2-2">


</div>
