org/CS/os.org
*** Round
#+BEGIN_VERSE
4 Modes:
Round-to-even eg: 1.5 approximate 2, 2.5 approximate 2 (DEFAULT)
Round-toward-zero eg:-1.5 approximate -1, 1.5 approximate 1
Round-down eg: 1.5 approximate 1
Round-up eg: 1.5 approximate 2
#+END_VERSE
*** Arithmatic Operation
Round(x?y)
$$x+^fy=Round(x+y)$$
Floating arithmatic doesn't satisfied associativity, distributivity.
* Program Structure
** Data Formats
*sizes in IA32.*
| C declaration | Intel            | Assembly code suffix | Size(bytes) |
|---------------+------------------+----------------------+-------------|
| char          | Byte             | b                    |           1 |
| short         | Word             | w                    |           2 |
| int           | Double word      | l                    |           4 |
| long int      | Double word      | l                    |           4 |
| long long int | —                | —                    |           4 |
| char *        | Double word      | l                    |           4 |
| float         | Single precision | s                    |           4 |
| double        | Double precision | l                    |           8 |
| long double   | Extend precision | t                    |       10/12 |
** Interger Registers
| 31   | 16  | 15---8 | 7---0 |
| %eax | %ax | %ah    | %al   |
| %ecx | %cx | %ch    | %cl   |
| %edx | %dx | %dh    | %dl   |
| %ebx | %bx | %bh    | %bl   |
| %esi | %si |        |       |
| %edi | %di |        |       |
| %esp | %sp |        |       |
| %ebp | %bp |        |       |
** Accessing Information
#+BEGIN_VERSE
$R[E_a]$ indicate the value of register a.
$M[Addr]$ indicate the memory location
#+END_VERSE
| Form                      | Operand Value                           |
|---------------------------+-----------------------------------------|
| \(\textit{\$ Imm}\)       | $\textit{Imm}$                          |
| $E_a$                     | $R[E_a]$                                |
| $\textit{Imm}$            | $M[\textit{Imm}]$                       |
| $(E_a)$                   | $M[R[E_a]]$                             |
| $\textit{Imm}(E_b)$       | $M[\textit{Imm}+R[E_b]]$                |
| $(E_b,E_i)$               | $M[R[E_b]+R[E_i]]$                      |
| $\textit{Imm}(E_b,E_i)$   | $M[\textit{Imm}+R[E_b]+R[E_i]]$         |
| $(,E_i,s)$                | $M[R[E_i]\cdot{s}]$                     |
| $\textit{Imm}(E_b,E_i,s)$ | $M[\textit{Imm}+R[E_b]+R[E_i]\cdot{s}]$ |
** Basic Operations
*** Data Movement
| Instruction | Description                           |
|-------------+---------------------------------------|
| mov  S,D    | D <- S                                |
| movs S,D    | D <- SignExtend(S)                    |
| movz S,D    | D <- ZeroExtend(S)                    |
| push & pop  |                                       |
| pushl S     | R[%esp] <- R[%esp]-4; M[R[%esp]] <- S |
| popl D      | D <- M[R[%esp]]; R[%esp] <- R[%esp]+4 |
#+BEGIN_VERSE
movs include: movsbw,movsbl,movswl
the same for movz.
#+END_VERSE
pushl %ebp is equivalent to the following pair of instuctions:
#+BEGIN_SRC asm
subl $4,%esp
movl %ebp,(%esp)
#+END_SRC
popl %eax:
#+BEGIN_SRC asm
movl (%esp),%esp
addl $4,%esp
#+END_SRC
*** Arithmetic & Logical Operations
| Instruction | Description                         |
|-------------+-------------------------------------|
| lea  S,D    | D <- &S                             |
| unary op    |                                     |
| inc D       | D <- D+1                            |
| dec D       | D <- D-1                            |
| neg D       | D <- -D                             |
| not D       | D <- ~D(complement)                 |
| binary op   | second operand: src & dest          |
| add S,D     | D <- D+S                            |
| sub S,D     | D <- D-S                            |
| imul S,D    | D <- D*S  (use $*^u_{32} *^t_{32}$) |
| xor S,D     | D <- D^S                            |
| or S,D      | D <- D\vert{}S                      |
| and S,D     | D <- D&S                            |
| shift op    |                                     |
| sal k,D     | D <- D<<k                           |
| shl k,D     | D <- D<<k(same as sal)              |
| sar k,D     | D <- D>>k(arithmetic shift)         |
| shr k,D     | D <- D>>k(logical shift)            |
*** About xorl x, x
For c code:
#+BEGIN_SRC c
int x=1;
#+END_SRC
#+BEGIN_SRC asm
GCC -O1:
movl $0x00, %eax (binary b8 00 00 00 00)

GCC -O2:
xorl $edx,%edx (binary 31 c0)
#+END_SRC
