CS/os.html

<div id="outline-container-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Round</h4>
<div class="outline-text-4" id="text-2-2-1">


<p class="verse">
4 Modes:<br/>
Round-to-even eg: 1.5 approximate 2, 2.5 approximate 2 (DEFAULT)<br/>
Round-toward-zero eg:-1.5 approximate -1, 1.5 approximate 1<br/>
Round-down eg: 1.5 approximate 1<br/>
Round-up eg: 1.5 approximate 2<br/>
</p>


</div>

</div>

<div id="outline-container-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Arithmatic Operation</h4>
<div class="outline-text-4" id="text-2-2-2">

<p>Round(x?y)
$$x+^fy=Round(x+y)$$
Floating arithmatic doesn't satisfied associativity, distributivity.
</p></div>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Program Structure</h2>
<div class="outline-text-2" id="text-3">


</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Data Formats</h3>
<div class="outline-text-3" id="text-3-1">

<p><b>sizes in IA32.</b>
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="right" />
</colgroup>
<thead>
<tr><th scope="col" class="left">C declaration</th><th scope="col" class="left">Intel</th><th scope="col" class="left">Assembly code suffix</th><th scope="col" class="right">Size(bytes)</th></tr>
</thead>
<tbody>
<tr><td class="left">char</td><td class="left">Byte</td><td class="left">b</td><td class="right">1</td></tr>
<tr><td class="left">short</td><td class="left">Word</td><td class="left">w</td><td class="right">2</td></tr>
<tr><td class="left">int</td><td class="left">Double word</td><td class="left">l</td><td class="right">4</td></tr>
<tr><td class="left">long int</td><td class="left">Double word</td><td class="left">l</td><td class="right">4</td></tr>
<tr><td class="left">long long int</td><td class="left">—</td><td class="left">—</td><td class="right">4</td></tr>
<tr><td class="left">char *</td><td class="left">Double word</td><td class="left">l</td><td class="right">4</td></tr>
<tr><td class="left">float</td><td class="left">Single precision</td><td class="left">s</td><td class="right">4</td></tr>
<tr><td class="left">double</td><td class="left">Double precision</td><td class="left">l</td><td class="right">8</td></tr>
<tr><td class="left">long double</td><td class="left">Extend precision</td><td class="left">t</td><td class="right">10/12</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Interger Registers</h3>
<div class="outline-text-3" id="text-3-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">31</td><td class="left">16</td><td class="left">15&mdash;8</td><td class="left">7&mdash;0</td></tr>
<tr><td class="left">%eax</td><td class="left">%ax</td><td class="left">%ah</td><td class="left">%al</td></tr>
<tr><td class="left">%ecx</td><td class="left">%cx</td><td class="left">%ch</td><td class="left">%cl</td></tr>
<tr><td class="left">%edx</td><td class="left">%dx</td><td class="left">%dh</td><td class="left">%dl</td></tr>
<tr><td class="left">%ebx</td><td class="left">%bx</td><td class="left">%bh</td><td class="left">%bl</td></tr>
<tr><td class="left">%esi</td><td class="left">%si</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">%edi</td><td class="left">%di</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">%esp</td><td class="left">%sp</td><td class="left"></td><td class="left"></td></tr>
<tr><td class="left">%ebp</td><td class="left">%bp</td><td class="left"></td><td class="left"></td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> Accessing Information</h3>
<div class="outline-text-3" id="text-3-3">


<p class="verse">
\(R[E_a]\) indicate the value of register a.<br/>
\(M[Addr]\) indicate the memory location<br/>
</p>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Form</th><th scope="col" class="left">Operand Value</th></tr>
</thead>
<tbody>
<tr><td class="left">\(\textit{\$ Imm}\)</td><td class="left">\(\textit{Imm}\)</td></tr>
<tr><td class="left">\(E_a\)</td><td class="left">\(R[E_a]\)</td></tr>
<tr><td class="left">\(\textit{Imm}\)</td><td class="left">\(M[\textit{Imm}]\)</td></tr>
<tr><td class="left">\((E_a)\)</td><td class="left">\(M[R[E_a]]\)</td></tr>
<tr><td class="left">\(\textit{Imm}(E_b)\)</td><td class="left">\(M[\textit{Imm}+R[E_b]]\)</td></tr>
<tr><td class="left">\((E_b,E_i)\)</td><td class="left">\(M[R[E_b]+R[E_i]]\)</td></tr>
<tr><td class="left">\(\textit{Imm}(E_b,E_i)\)</td><td class="left">\(M[\textit{Imm}+R[E_b]+R[E_i]]\)</td></tr>
<tr><td class="left">\((,E_i,s)\)</td><td class="left">\(M[R[E_i]\cdot{s}]\)</td></tr>
<tr><td class="left">\(\textit{Imm}(E_b,E_i,s)\)</td><td class="left">\(M[\textit{Imm}+R[E_b]+R[E_i]\cdot{s}]\)</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> Basic Operations</h3>
<div class="outline-text-3" id="text-3-4">


</div>

<div id="outline-container-3-4-1" class="outline-4">
<h4 id="sec-3-4-1"><span class="section-number-4">3.4.1</span> Data Movement</h4>
<div class="outline-text-4" id="text-3-4-1">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Instruction</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">mov  S,D</td><td class="left">D &lt;- S</td></tr>
<tr><td class="left">movs S,D</td><td class="left">D &lt;- SignExtend(S)</td></tr>
<tr><td class="left">movz S,D</td><td class="left">D &lt;- ZeroExtend(S)</td></tr>
<tr><td class="left">push &amp; pop</td><td class="left"></td></tr>
<tr><td class="left">pushl S</td><td class="left">R[%esp] &lt;- R[%esp]-4; M[R[%esp]] &lt;- S</td></tr>
<tr><td class="left">popl D</td><td class="left">D &lt;- M[R[%esp]]; R[%esp] &lt;- R[%esp]+4</td></tr>
</tbody>
</table>


<p class="verse">
movs include: movsbw,movsbl,movswl<br/>
the same for movz.<br/>
</p>


<p>
pushl %ebp is equivalent to the following pair of instuctions:
</p>


<pre class="src src-asm"><span style="color: #00008b; font-weight: bold;">subl</span> <span style="color: #1e90ff; font-weight: bold;">$4</span>,<span style="color: #008b8b;">%esp</span>
<span style="color: #00008b; font-weight: bold;">movl</span> <span style="color: #1e90ff; font-weight: bold;">%ebp</span>,(<span style="color: #008b8b;">%esp</span>)
</pre>

<p>
popl %eax:
</p>


<pre class="src src-asm"><span style="color: #00008b; font-weight: bold;">movl</span> (<span style="color: #008b8b;">%esp</span>),<span style="color: #008b8b;">%esp</span>
<span style="color: #00008b; font-weight: bold;">addl</span> <span style="color: #1e90ff; font-weight: bold;">$4</span>,<span style="color: #008b8b;">%esp</span>
</pre>

</div>

</div>

<div id="outline-container-3-4-2" class="outline-4">
<h4 id="sec-3-4-2"><span class="section-number-4">3.4.2</span> Arithmetic &amp; Logical Operations</h4>
<div class="outline-text-4" id="text-3-4-2">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Instruction</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">lea  S,D</td><td class="left">D &lt;- &amp;S</td></tr>
<tr><td class="left">unary op</td><td class="left"></td></tr>
<tr><td class="left">inc D</td><td class="left">D &lt;- D+1</td></tr>
<tr><td class="left">dec D</td><td class="left">D &lt;- D-1</td></tr>
<tr><td class="left">neg D</td><td class="left">D &lt;- -D</td></tr>
<tr><td class="left">not D</td><td class="left">D &lt;- ~D(complement)</td></tr>
<tr><td class="left">binary op</td><td class="left">second operand: src &amp; dest</td></tr>
<tr><td class="left">add S,D</td><td class="left">D &lt;- D+S</td></tr>
<tr><td class="left">sub S,D</td><td class="left">D &lt;- D-S</td></tr>
<tr><td class="left">imul S,D</td><td class="left">D &lt;- D*S  (use \(*^u_{32} *^t_{32}\))</td></tr>
<tr><td class="left">xor S,D</td><td class="left">D &lt;- D^S</td></tr>
<tr><td class="left">or S,D</td><td class="left">D &lt;- D&#124;S</td></tr>
<tr><td class="left">and S,D</td><td class="left">D &lt;- D&amp;S</td></tr>
<tr><td class="left">shift op</td><td class="left"></td></tr>
<tr><td class="left">sal k,D</td><td class="left">D &lt;- D&lt;&lt;k</td></tr>
<tr><td class="left">shl k,D</td><td class="left">D &lt;- D&lt;&lt;k(same as sal)</td></tr>
<tr><td class="left">sar k,D</td><td class="left">D &lt;- D&gt;&gt;k(arithmetic shift)</td></tr>
<tr><td class="left">shr k,D</td><td class="left">D &lt;- D&gt;&gt;k(logical shift)</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-3-4-3" class="outline-4">
<h4 id="sec-3-4-3"><span class="section-number-4">3.4.3</span> About xorl x, x</h4>
<div class="outline-text-4" id="text-3-4-3">

<p>For c code:
</p>


<pre class="src src-c"><span style="color: #daa520;">int</span> <span style="color: #008b8b;">x</span>=1;
</pre>


<pre class="src src-asm"><span style="color: #00008b; font-weight: bold;">GCC</span> -O1:
<span style="color: #00008b; font-weight: bold;">movl</span> <span style="color: #1e90ff; font-weight: bold;">$0x00</span>, <span style="color: #008b8b;">%eax</span> (binary b8 00 00 00 00)

<span style="color: #00008b; font-weight: bold;">GCC</span> -O2:
<span style="color: #00008b; font-weight: bold;">xorl</span> <span style="color: #1e90ff; font-weight: bold;">$edx</span>,<span style="color: #008b8b;">%edx</span> (binary 31 c0)
</pre>

</div>

</div>
