org/CS/os.org
*** Special Arithmetic Operations
imul also support one-operand operaion.
| Instruction | Description                               |
|-------------+-------------------------------------------|
| imull S     | R[%edx]:R[%eax] <- S*R[%eax] (Signed)     |
| mull S      | R[%edx]:R[%eax] <- S*R[%eax] (Unsigned)   |
| cltd        | R[%edx]:R[%eax] <- SignExtend(R[%eax])    |
| idivl S     | R[%edx] <- R[%edx]:R[%eax] mod S;(Signed) |
|             | R[%eax] <- R[%edx]:R[%eax] / S;(Signed)   |

** Control
*** Condiction Register
Four flags:
| CF | carry flag    |
| ZF | zero flag     |
| SF | sign flag     |
| OF | overflow flag |
For t=a+b
| CF | (unsigned)t < (unsigned)a  | Unsigned Overflow |
| ZF | (t == 0)                   | Zero              |
| SF | (t < 0)                    | Negative          |
| OF | (a<0 == b<0)&&(t<0 != a<0) | Signed Overflow   |
instructions that set the condiction code without updating their destination.
| Instruction    | Effect        | Like |
| cmp $S_2, S_1$ | $S_1-S_2$     | sub  |
| test $S_2,S_1$ | $S_1$ & $S_2$ | and  |
*** Accessing the Condition Codes
Three common ways of using the condition codes:
1) set a single byte to 0 or 1 depending on some combination of the condition codes.
2) conditionally jump to some other part of the program
3) conditionally transfer data.
for (1), we use set instruction:
| Instruction | Synonym | Effect   | Set condition      |
| sete D      | setz    | D <- ZF  | Equal/zero         |
| setne D     | setnz   | D <- ~ZF | Not Equal/not zero |
| sets D      |         | D <- SF  | Negative           |
| setns D     |         | D <- ~SF | Nonnegative        |
Signed Group:
| setg D  | setnle | D <- ~(SF^OF) & ~ZF   | >  |
| setge D | setnl  | D <- ~(SF^OF)         | >= |
| setl D  | setnge | D <- SF^OF            | <  |
| setle D | setnge | D <- (SF^OF) \vert ZF | <= |
Unsigned Group:
| seta D  | setnbe | D <- ~CF & ~ZF    | >  |
| setae D | setnb  | D <- ~CF          | >= |
| setb D  | setnae | D <- CF           | <  |
| setbe D | setna  | D <- CF \vert  ZF | <= |

*** Jump Instruction
| Instruction  | Synonym       | Condition |
| jmp Label    | direct jump   | 1         |
| jmp *Operand | indirect jump | 1         |
| je L         | jz            | ZF        |
| jne L        | jnz           | ~ZF       |
| js L         |               | SF        |
| jns L        |               | ~SF       |
Signed Group:  
| jg L  | jnle | ~(SF^OF)&~ZF     |
| jge L | jnl  | ~(SF^OF)         |
| jl L  | jnge | SF^OF            |
| jle L | jng  | (SF^OF)\vert{}ZF |
Unsigned Group:
| ja L  | jnbe | ~CF & ~ZF   |
| jae L | jnb  | ~CF         |
| jb L  | jnae | CF          |
| jbe L | jna  | CF\vert{}ZF |

*** If Statement
General in C:
#+BEGIN_EXAMPLE
  if (test-expr)
     then-statement
  else
     else-statement
#+END_EXAMPLE
nomal form with goto statement:
#+BEGIN_EXAMPLE
      t = test-expr;
      if (t)
         goto true;
      else-statement
      goto done;
  true:
      then-statement
  done:
#+END_EXAMPLE
assembly form:
#+BEGIN_EXAMPLE
      t = test-expr;
      if (!t)
         goto false-label;
      then-statement
      goto done;
  false-label:
      else-statement
  done:
#+END_EXAMPLE
major difference: when there is no else-statement.
#+BEGIN_EXAMPLE
      t = test-expr;
      if (!t)
         goto done;
      then-statement
  done:
#+END_EXAMPLE
