CS/os.html

<div id="outline-container-3-4-4" class="outline-4">
<h4 id="sec-3-4-4"><span class="section-number-4">3.4.4</span> Special Arithmetic Operations</h4>
<div class="outline-text-4" id="text-3-4-4">

<p>imul also support one-operand operaion.
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Instruction</th><th scope="col" class="left">Description</th></tr>
</thead>
<tbody>
<tr><td class="left">imull S</td><td class="left">R[%edx]:R[%eax] &lt;- S*R[%eax] (Signed)</td></tr>
<tr><td class="left">mull S</td><td class="left">R[%edx]:R[%eax] &lt;- S*R[%eax] (Unsigned)</td></tr>
<tr><td class="left">cltd</td><td class="left">R[%edx]:R[%eax] &lt;- SignExtend(R[%eax])</td></tr>
<tr><td class="left">idivl S</td><td class="left">R[%edx] &lt;- R[%edx]:R[%eax] mod S;(Signed)</td></tr>
<tr><td class="left"></td><td class="left">R[%eax] &lt;- R[%edx]:R[%eax] / S;(Signed)</td></tr>
</tbody>
</table>


</div>
</div>

</div>

<div id="outline-container-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Control</h3>
<div class="outline-text-3" id="text-3-5">


</div>

<div id="outline-container-3-5-1" class="outline-4">
<h4 id="sec-3-5-1"><span class="section-number-4">3.5.1</span> Condiction Register</h4>
<div class="outline-text-4" id="text-3-5-1">

<p>Four flags:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">CF</td><td class="left">carry flag</td></tr>
<tr><td class="left">ZF</td><td class="left">zero flag</td></tr>
<tr><td class="left">SF</td><td class="left">sign flag</td></tr>
<tr><td class="left">OF</td><td class="left">overflow flag</td></tr>
</tbody>
</table>

For t=a+b
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">CF</td><td class="left">(unsigned)t &lt; (unsigned)a</td><td class="left">Unsigned Overflow</td></tr>
<tr><td class="left">ZF</td><td class="left">(t == 0)</td><td class="left">Zero</td></tr>
<tr><td class="left">SF</td><td class="left">(t &lt; 0)</td><td class="left">Negative</td></tr>
<tr><td class="left">OF</td><td class="left">(a&lt;0 == b&lt;0)&amp;&amp;(t&lt;0 != a&lt;0)</td><td class="left">Signed Overflow</td></tr>
</tbody>
</table>

instructions that set the condiction code without updating their destination.
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Instruction</td><td class="left">Effect</td><td class="left">Like</td></tr>
<tr><td class="left">cmp \(S_2, S_1\)</td><td class="left">\(S_1-S_2\)</td><td class="left">sub</td></tr>
<tr><td class="left">test \(S_2,S_1\)</td><td class="left">\(S_1\) &amp; \(S_2\)</td><td class="left">and</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-3-5-2" class="outline-4">
<h4 id="sec-3-5-2"><span class="section-number-4">3.5.2</span> Accessing the Condition Codes</h4>
<div class="outline-text-4" id="text-3-5-2">

<p>Three common ways of using the condition codes:
</p><ol>
<li>set a single byte to 0 or 1 depending on some combination of the condition codes.
</li>
<li>conditionally jump to some other part of the program
</li>
<li>conditionally transfer data.
</li>
</ol>

<p>for (1), we use set instruction:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Instruction</td><td class="left">Synonym</td><td class="left">Effect</td><td class="left">Set condition</td></tr>
<tr><td class="left">sete D</td><td class="left">setz</td><td class="left">D &lt;- ZF</td><td class="left">Equal/zero</td></tr>
<tr><td class="left">setne D</td><td class="left">setnz</td><td class="left">D &lt;- ~ZF</td><td class="left">Not Equal/not zero</td></tr>
<tr><td class="left">sets D</td><td class="left"></td><td class="left">D &lt;- SF</td><td class="left">Negative</td></tr>
<tr><td class="left">setns D</td><td class="left"></td><td class="left">D &lt;- ~SF</td><td class="left">Nonnegative</td></tr>
</tbody>
</table>

Signed Group:
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">setg D</td><td class="left">setnle</td><td class="left">D &lt;- ~(SF^OF) &amp; ~ZF</td><td class="left">&gt;</td></tr>
<tr><td class="left">setge D</td><td class="left">setnl</td><td class="left">D &lt;- ~(SF^OF)</td><td class="left">&gt;=</td></tr>
<tr><td class="left">setl D</td><td class="left">setnge</td><td class="left">D &lt;- SF^OF</td><td class="left">&lt;</td></tr>
<tr><td class="left">setle D</td><td class="left">setnge</td><td class="left">D &lt;- (SF^OF) &#124; ZF</td><td class="left">&lt;=</td></tr>
</tbody>
</table>

Unsigned Group:
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">seta D</td><td class="left">setnbe</td><td class="left">D &lt;- ~CF &amp; ~ZF</td><td class="left">&gt;</td></tr>
<tr><td class="left">setae D</td><td class="left">setnb</td><td class="left">D &lt;- ~CF</td><td class="left">&gt;=</td></tr>
<tr><td class="left">setb D</td><td class="left">setnae</td><td class="left">D &lt;- CF</td><td class="left">&lt;</td></tr>
<tr><td class="left">setbe D</td><td class="left">setna</td><td class="left">D &lt;- CF &#124;  ZF</td><td class="left">&lt;=</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3-5-3" class="outline-4">
<h4 id="sec-3-5-3"><span class="section-number-4">3.5.3</span> Jump Instruction</h4>
<div class="outline-text-4" id="text-3-5-3">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Instruction</td><td class="left">Synonym</td><td class="left">Condition</td></tr>
<tr><td class="left">jmp Label</td><td class="left">direct jump</td><td class="left">1</td></tr>
<tr><td class="left">jmp *Operand</td><td class="left">indirect jump</td><td class="left">1</td></tr>
<tr><td class="left">je L</td><td class="left">jz</td><td class="left">ZF</td></tr>
<tr><td class="left">jne L</td><td class="left">jnz</td><td class="left">~ZF</td></tr>
<tr><td class="left">js L</td><td class="left"></td><td class="left">SF</td></tr>
<tr><td class="left">jns L</td><td class="left"></td><td class="left">~SF</td></tr>
</tbody>
</table>

Signed Group:  
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">jg L</td><td class="left">jnle</td><td class="left">~(SF^OF)&amp;~ZF</td></tr>
<tr><td class="left">jge L</td><td class="left">jnl</td><td class="left">~(SF^OF)</td></tr>
<tr><td class="left">jl L</td><td class="left">jnge</td><td class="left">SF^OF</td></tr>
<tr><td class="left">jle L</td><td class="left">jng</td><td class="left">(SF^OF)&#124;ZF</td></tr>
</tbody>
</table>

Unsigned Group:
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">ja L</td><td class="left">jnbe</td><td class="left">~CF &amp; ~ZF</td></tr>
<tr><td class="left">jae L</td><td class="left">jnb</td><td class="left">~CF</td></tr>
<tr><td class="left">jb L</td><td class="left">jnae</td><td class="left">CF</td></tr>
<tr><td class="left">jbe L</td><td class="left">jna</td><td class="left">CF&#124;ZF</td></tr>
</tbody>
</table>


</div>

</div>

<div id="outline-container-3-5-4" class="outline-4">
<h4 id="sec-3-5-4"><span class="section-number-4">3.5.4</span> If Statement</h4>
<div class="outline-text-4" id="text-3-5-4">

<p>General in C:
</p>


<pre class="example">if (test-expr)
   then-statement
else
   else-statement
</pre>

<p>
nomal form with goto statement:
</p>


<pre class="example">    t = test-expr;
    if (t)
       goto true;
    else-statement
    goto done;
true:
    then-statement
done:
</pre>

<p>
assembly form:
</p>


<pre class="example">    t = test-expr;
    if (!t)
       goto false-label;
    then-statement
    goto done;
false-label:
    else-statement
done:
</pre>

<p>
major difference: when there is no else-statement.
</p>


<pre class="example">    t = test-expr;
    if (!t)
       goto done;
    then-statement
done:
</pre>

<ul>
<li id="sec-3-5-4-1">example<br/>
