org/CS/os.org
**** example
#+BEGIN_SRC c
  int test(int x, int y)
  {
      int val = x^y;
      if (x < -3)
      {
          if (y < x)
              val = x*y;
          else
              val = x+y;
      }
      else if (x > 2)
          val = x-y;
      return val;
  }
#+END_SRC
#+BEGIN_SRC asm
      movl    12(%ebp), %eax
      movl    8(%ebp), %edx
      cmpl    $-3, %eax
      jge .L2
      cmpl    %edx, %eax
      jle .L3
      imull   %edx, %eax
      jmp .L4
  .L3:
      leal    (%edx,%eax), %eax
      jmp .L4
  .L2:
      cmpl    $2, %eax
      jg .L5
      xorl    %edx, %eax
      jmp .L4
  .L5:
      subl %edx, %eax
  .L4:
#+END_SRC
*** Loops
**** do...while
#+BEGIN_EXAMPLE
  do
      body-statement
  while (test-expr)
#+END_EXAMPLE
goto version:
#+BEGIN_EXAMPLE
  loop:
      body-statement
      t = test-expr;
      if (t)
         goto loop;
  done:
#+END_EXAMPLE
**** while
#+BEGIN_EXAMPLE
  while (test-expr)
      body-statement
#+END_EXAMPLE
goto version:
#+BEGIN_EXAMPLE
  t = test-expr
  if (!t)
     goto done;
  loop:
     body-statement
     if (t)
        goto loop;
  done:
#+END_EXAMPLE
**** for
#+BEGIN_EXAMPLE
  for (init-expr; test-expr; update-expr)
      body-statement
#+END_EXAMPLE
Equivalent to while loop
#+BEGIN_EXAMPLE
  init-expr;
  while (test-expr)
      body-statement
      update-expr;
#+END_EXAMPLE
goto vesion:
#+BEGIN_EXAMPLE
  init-expr;
  t = test-expr;
  if (!t)
     goto done;
  
  loop:
     body-statement
     update-expr;
     if (t)
        goto loop;
  done:
#+END_EXAMPLE
*** Conditional Move Instructions
**** Why use?
#+BEGIN_VERSE
Processors achieve high performance by overlapping the steps of the
successive instructions, such as fetching one instruction while 
performing the arithmetic operations for a previous instruction.
#+END_VERSE
**** Instructions
| Instruction | Synonym | Condition        |
|-------------+---------+------------------|
| cmove S, R  | cmovz   | ZF               |
| cmovne      | cmovnz  | ~ZF              |
| cmovs       |         | SF               |
| cmovns      |         | ~SF              |
| cmovg       | cmovnle | ~(SF^OF)&~ZF     |
| cmovge      | cmovnl  | ~(SF^OF)         |
| cmovl       | cmovnge | SF^OF            |
| cmovle      | cmovng  | (SF^OF)\vert{}ZF |
| cmova       | cmovnbe | ~CF&~ZF          |
| cmovae      | cmovnb  | ~CF              |
| cmovb       | cmovnae | CF               |
| cmovbe      | cmovna  | CF\vert{}ZF      |

**** example
Expression:
#+BEGIN_EXAMPLE
  v = test-expr ? then-expr : else-expr;
#+END_EXAMPLE
Traditional IA32:
#+BEGIN_EXAMPLE
      if (!test-expr)
          goto false;
      v = then-expr;
      goto done;
  false:
      v = else-expr;
  done:
#+END_EXAMPLE
Base the on conditional move:
#+BEGIN_EXAMPLE
  vt = then-expr;
  v = else-expr;
  t = test-expr;
  if (t) v = vt;
#+END_EXAMPLE
*** Switch Statement
Using the jump table
#+BEGIN_SRC asm
  .L8:
          .long   .L3 //index 0
          .long   .L2//1
          .long   .L4//2
          .long   .L5//3
          .long   .L6//4
          .long   .L6//5
          .long   .L7//6
#+END_SRC
#+BEGIN_SRC asm
  movl    8(%ebp),    %eax //x at %ebp+8
  addl    $2, %eax //index = x+2. when index = 0, x(min)=-2.
  cmpl    $6, %eax //index compare with 6
  ja      .L2 //index > 6 goto default. Such that, x(max)=4.
  jmp *.L8(,%eax,4)
#+END_SRC
x case 2, 3 goes to .L6
** Procedure
*** Stack Frame
caller's frame:
| arg n |
| ...   |
| arg 1 |
| return address |
callee's frame:
| Saved %ebp                              |
| Saved registers, local var, temporaries |
| Argument build area    (%esp)           |
*** Procedure Call
Instructions:
| call Label    | procedure call           |
| call *Operand | procedure call           |
| leave         | prepare stack for return |
| ret           | return from call         |

- call
#+BEGIN_VERSE
A /call/ instruction is to push a return address on the stack
and jump to the start of the called procedure.
#+END_VERSE
- ret
#+BEGIN_VERSE
The /ret/ instruction pops an address off the stack and jumps
to return address of the caller procedure.
#+END_VERSE
- leave
#+BEGIN_VERSE
equilvalent to the following:
movl %ebp, %esp
popl %ebp
#+END_VERSE
