CS/os.html



<pre class="src src-c"><span style="color: #daa520;">int</span> <span style="color: #00008b; font-weight: bold;">test</span>(<span style="color: #daa520;">int</span> <span style="color: #008b8b;">x</span>, <span style="color: #daa520;">int</span> <span style="color: #008b8b;">y</span>)
{
    <span style="color: #daa520;">int</span> <span style="color: #008b8b;">val</span> = x^y;
    <span style="color: #1e90ff; font-weight: bold;">if</span> (x &lt; -3)
    {
        <span style="color: #1e90ff; font-weight: bold;">if</span> (y &lt; x)
            val = x*y;
        <span style="color: #1e90ff; font-weight: bold;">else</span>
            val = x+y;
    }
    <span style="color: #1e90ff; font-weight: bold;">else</span> <span style="color: #1e90ff; font-weight: bold;">if</span> (x &gt; 2)
        val = x-y;
    <span style="color: #1e90ff; font-weight: bold;">return</span> val;
}
</pre>


<pre class="src src-asm">    <span style="color: #1e90ff; font-weight: bold;">movl</span>    12(<span style="color: #008b8b;">%ebp</span>), <span style="color: #008b8b;">%eax</span>
    <span style="color: #1e90ff; font-weight: bold;">movl</span>    8(<span style="color: #008b8b;">%ebp</span>), <span style="color: #008b8b;">%edx</span>
    <span style="color: #1e90ff; font-weight: bold;">cmpl</span>    $-3, <span style="color: #008b8b;">%eax</span>
    <span style="color: #1e90ff; font-weight: bold;">jge</span> .L2
    <span style="color: #1e90ff; font-weight: bold;">cmpl</span>    <span style="color: #008b8b;">%edx</span>, <span style="color: #008b8b;">%eax</span>
    <span style="color: #1e90ff; font-weight: bold;">jle</span> .L3
    <span style="color: #1e90ff; font-weight: bold;">imull</span>   <span style="color: #008b8b;">%edx</span>, <span style="color: #008b8b;">%eax</span>
    <span style="color: #1e90ff; font-weight: bold;">jmp</span> .L4
<span style="color: #00008b; font-weight: bold;">.L3</span>:
    <span style="color: #1e90ff; font-weight: bold;">leal</span>    (<span style="color: #008b8b;">%edx</span>,<span style="color: #008b8b;">%eax</span>), <span style="color: #008b8b;">%eax</span>
    <span style="color: #1e90ff; font-weight: bold;">jmp</span> .L4
<span style="color: #00008b; font-weight: bold;">.L2</span>:
    <span style="color: #1e90ff; font-weight: bold;">cmpl</span>    $2, <span style="color: #008b8b;">%eax</span>
    <span style="color: #1e90ff; font-weight: bold;">jg</span> .L5
    <span style="color: #1e90ff; font-weight: bold;">xorl</span>    <span style="color: #008b8b;">%edx</span>, <span style="color: #008b8b;">%eax</span>
    <span style="color: #1e90ff; font-weight: bold;">jmp</span> .L4
<span style="color: #00008b; font-weight: bold;">.L5</span>:
    <span style="color: #1e90ff; font-weight: bold;">subl</span> <span style="color: #008b8b;">%edx</span>, <span style="color: #008b8b;">%eax</span>
<span style="color: #00008b; font-weight: bold;">.L4</span>:
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-3-5-5" class="outline-4">
<h4 id="sec-3-5-5"><span class="section-number-4">3.5.5</span> Loops</h4>
<div class="outline-text-4" id="text-3-5-5">

<ul>
<li id="sec-3-5-5-1">do&hellip;while<br/>



<pre class="example">do
    body-statement
while (test-expr)
</pre>

<p>
goto version:
</p>


<pre class="example">loop:
    body-statement
    t = test-expr;
    if (t)
       goto loop;
done:
</pre>

</li>
</ul>
<ul>
<li id="sec-3-5-5-2">while<br/>



<pre class="example">while (test-expr)
    body-statement
</pre>

<p>
goto version:
</p>


<pre class="example">t = test-expr
if (!t)
   goto done;
loop:
   body-statement
   if (t)
      goto loop;
done:
</pre>

</li>
</ul>
<ul>
<li id="sec-3-5-5-3">for<br/>



<pre class="example">for (init-expr; test-expr; update-expr)
    body-statement
</pre>

<p>
Equivalent to while loop
</p>


<pre class="example">init-expr;
while (test-expr)
    body-statement
    update-expr;
</pre>

<p>
goto vesion:
</p>


<pre class="example">init-expr;
t = test-expr;
if (!t)
   goto done;

loop:
   body-statement
   update-expr;
   if (t)
      goto loop;
done:
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-3-5-6" class="outline-4">
<h4 id="sec-3-5-6"><span class="section-number-4">3.5.6</span> Conditional Move Instructions</h4>
<div class="outline-text-4" id="text-3-5-6">

<ul>
<li id="sec-3-5-6-1">Why use?<br/>

<p class="verse">
Processors achieve high performance by overlapping the steps of the<br/>
successive instructions, such as fetching one instruction while <br/>
performing the arithmetic operations for a previous instruction.<br/>
</p>


</li>
</ul>
<ul>
<li id="sec-3-5-6-2">Instructions<br/>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Instruction</th><th scope="col" class="left">Synonym</th><th scope="col" class="left">Condition</th></tr>
</thead>
<tbody>
<tr><td class="left">cmove S, R</td><td class="left">cmovz</td><td class="left">ZF</td></tr>
<tr><td class="left">cmovne</td><td class="left">cmovnz</td><td class="left">~ZF</td></tr>
<tr><td class="left">cmovs</td><td class="left"></td><td class="left">SF</td></tr>
<tr><td class="left">cmovns</td><td class="left"></td><td class="left">~SF</td></tr>
<tr><td class="left">cmovg</td><td class="left">cmovnle</td><td class="left">~(SF^OF)&amp;~ZF</td></tr>
<tr><td class="left">cmovge</td><td class="left">cmovnl</td><td class="left">~(SF^OF)</td></tr>
<tr><td class="left">cmovl</td><td class="left">cmovnge</td><td class="left">SF^OF</td></tr>
<tr><td class="left">cmovle</td><td class="left">cmovng</td><td class="left">(SF^OF)&#124;ZF</td></tr>
<tr><td class="left">cmova</td><td class="left">cmovnbe</td><td class="left">~CF&amp;~ZF</td></tr>
<tr><td class="left">cmovae</td><td class="left">cmovnb</td><td class="left">~CF</td></tr>
<tr><td class="left">cmovb</td><td class="left">cmovnae</td><td class="left">CF</td></tr>
<tr><td class="left">cmovbe</td><td class="left">cmovna</td><td class="left">CF&#124;ZF</td></tr>
</tbody>
</table>


</li>
</ul>
<ul>
<li id="sec-3-5-6-3">example<br/>
Expression:



<pre class="example">v = test-expr ? then-expr : else-expr;
</pre>

<p>
Traditional IA32:
</p>


<pre class="example">    if (!test-expr)
        goto false;
    v = then-expr;
    goto done;
false:
    v = else-expr;
done:
</pre>

<p>
Base the on conditional move:
</p>


<pre class="example">vt = then-expr;
v = else-expr;
t = test-expr;
if (t) v = vt;
</pre>

</li>
</ul>
</div>

</div>

<div id="outline-container-3-5-7" class="outline-4">
<h4 id="sec-3-5-7"><span class="section-number-4">3.5.7</span> Switch Statement</h4>
<div class="outline-text-4" id="text-3-5-7">

<p>Using the jump table
</p>


<pre class="src src-asm"><span style="color: #00008b; font-weight: bold;">.L8</span>:
        <span style="color: #1e90ff; font-weight: bold;">.long</span>   .L3 <span style="color: #8b8989;">//</span><span style="color: #8b8989;">index 0</span>
        <span style="color: #1e90ff; font-weight: bold;">.long</span>   .L2<span style="color: #8b8989;">//</span><span style="color: #8b8989;">1</span>
        <span style="color: #1e90ff; font-weight: bold;">.long</span>   .L4<span style="color: #8b8989;">//</span><span style="color: #8b8989;">2</span>
        <span style="color: #1e90ff; font-weight: bold;">.long</span>   .L5<span style="color: #8b8989;">//</span><span style="color: #8b8989;">3</span>
        <span style="color: #1e90ff; font-weight: bold;">.long</span>   .L6<span style="color: #8b8989;">//</span><span style="color: #8b8989;">4</span>
        <span style="color: #1e90ff; font-weight: bold;">.long</span>   .L6<span style="color: #8b8989;">//</span><span style="color: #8b8989;">5</span>
        <span style="color: #1e90ff; font-weight: bold;">.long</span>   .L7<span style="color: #8b8989;">//</span><span style="color: #8b8989;">6</span>
</pre>


<pre class="src src-asm"><span style="color: #00008b; font-weight: bold;">movl</span>    <span style="color: #1e90ff; font-weight: bold;">8</span>(<span style="color: #008b8b;">%ebp</span>),    <span style="color: #008b8b;">%eax</span> <span style="color: #8b8989;">//</span><span style="color: #8b8989;">x at %ebp+8</span>
<span style="color: #00008b; font-weight: bold;">addl</span>    <span style="color: #1e90ff; font-weight: bold;">$2</span>, <span style="color: #008b8b;">%eax</span> <span style="color: #8b8989;">//</span><span style="color: #8b8989;">index = x+2. when index = 0, x(min)=-2.</span>
<span style="color: #00008b; font-weight: bold;">cmpl</span>    <span style="color: #1e90ff; font-weight: bold;">$6</span>, <span style="color: #008b8b;">%eax</span> <span style="color: #8b8989;">//</span><span style="color: #8b8989;">index compare with 6</span>
<span style="color: #00008b; font-weight: bold;">ja</span>      .L2 <span style="color: #8b8989;">//</span><span style="color: #8b8989;">index &gt; 6 goto default. Such that, x(max)=4.</span>
<span style="color: #00008b; font-weight: bold;">jmp</span> *.L8(,<span style="color: #008b8b;">%eax</span>,4)
</pre>

<p>
x case 2, 3 goes to .L6
</p></div>
</div>

</div>

<div id="outline-container-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> Procedure</h3>
<div class="outline-text-3" id="text-3-6">


</div>

<div id="outline-container-3-6-1" class="outline-4">
<h4 id="sec-3-6-1"><span class="section-number-4">3.6.1</span> Stack Frame</h4>
<div class="outline-text-4" id="text-3-6-1">

<p>caller's frame:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">arg n</td></tr>
<tr><td class="left">&hellip;</td></tr>
<tr><td class="left">arg 1</td></tr>
<tr><td class="left">return address</td></tr>
</tbody>
</table>

callee's frame:
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Saved %ebp</td></tr>
<tr><td class="left">Saved registers, local var, temporaries</td></tr>
<tr><td class="left">Argument build area    (%esp)</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-3-6-2" class="outline-4">
<h4 id="sec-3-6-2"><span class="section-number-4">3.6.2</span> Procedure Call</h4>
<div class="outline-text-4" id="text-3-6-2">

<p>Instructions:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" /><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">call Label</td><td class="left">procedure call</td></tr>
<tr><td class="left">call *Operand</td><td class="left">procedure call</td></tr>
<tr><td class="left">leave</td><td class="left">prepare stack for return</td></tr>
<tr><td class="left">ret</td><td class="left">return from call</td></tr>
</tbody>
</table>


<ul>
<li>call
</li>
</ul>


<p class="verse">
A <i>call</i> instruction is to push a return address on the stack<br/>
and jump to the start of the called procedure.<br/>
</p>


<ul>
<li>ret
</li>
</ul>


<p class="verse">
The <i>ret</i> instruction pops an address off the stack and jumps<br/>
to return address of the caller procedure.<br/>
</p>


<ul>
<li>leave
</li>
</ul>


<p class="verse">
equilvalent to the following:<br/>
movl %ebp, %esp<br/>
popl %ebp<br/>
</p>


</div>

</div>
