org/CS/os.org
*** Registers
#+BEGIN_VERSE
%eax, %edx and %ecx are classified as caller-save registers.
callee can overwrite them without destroying any data required by P.

%ebx, %esi and %edi : callee-save registers.
callee must save the values on the stack before overwriting them,
and restore them before returning.
Because caller may need them for its future computations.
#+END_VERSE
*** Example
#+BEGIN_SRC c++
  int swap_add(int *xp, int *yp)
  {
      int x = *xp;
      int y = *yp;
  
      ,*xp = y;
      ,*yp = x;
      return x + y;
  }
  
  int caller()
  {
      int arg1 = 534;
      int arg2 = 1057;
      int sum = swap_add(&arg1, &arg2);
      int diff = arg1 - arg2;
  
      return sum * diff;
  }
#+END_SRC
**** Caller
#+BEGIN_SRC asm
  caller:
      pushl %ebp              //Save old %ebp
      movl %esp, %ebp         //Set %ebp as frame pointer
      subl $24, %esp          //Allocate 24 bytes on stack
      movl $534, -4(%ebp)     //Set arg1 to 534
      movl $1057, -8(%ebp)        //Set arg2 to 1057
      leal -8(%ebp), %eax     //Compute &arg2
      movl %eax, 4(%esp)      //Store on stack
      leal -4(%ebp), %eax         //Compute &arg1
      movl %eax, (%esp)       //Store on stack
      call swap_add               //Call the swap_add function
      movl -4(%ebp), %edx
      subl -8(%ebp), %edx
      imull %edx, %eax
      leave
      ret 
#+END_SRC
Stack Frame:
| Saved %ebp(%ebp) |
| arg1             |
| arg2             |
| /Unused/         |
| &arg2            |
| &arg1 (%esp)     |
After call:
| Saved %ebp       |
| arg1             |
| arg2             |
| /Unused          |
| &arg2            |
| &arg1            |
| Return address   |
| Saved %ebp(%ebp) |
| Saved %ebx(%esp) |
**** Callee
- setup
#+BEGIN_SRC asm
  swap_add:
      pushl %ebp
      movl %esp, %ebp
      pushl %ebx          //for temporary storage
#+END_SRC
- body
#+BEGIN_SRC asm
  movl    8(%ebp), %edx   //Get xp
  movl    12(%ebp), %ecx  //Get yp
  movl    (%edx), %ebx        //Get x
  movl    (%ecx), %eax        //Get y
  movl    %eax, (%edx)        //Store y at xp
  movl    %ebx, (%ecx)        //Store x at yp
  addl    %ebx, %eax      //Return value = x + y
#+END_SRC
- finish
#+BEGIN_SRC asm
  popl    %ebx        //Restore %ebx
  popl    %ebp        //Restore %ebp
  ret                 //Return
#+END_SRC
** Array Allocation
- $$\&A[i] = x_a + i\cdot sizeof(type)$$
- for an array declare as D[R][C], 
$$\&D[i][j] = x_d + sizeof(type)\cdot (C\cdot i + j)$$
#+BEGIN_EXAMPLE
s: start address  t: type size  declaration: A[R][C]
A[0]   A[0][0]    s
A[0]   A[0][1]    s+t
A[1]   A[1][0]    s+Ct
A[1]   A[1][2]    s+(C+2)t
A[3]   A[3][4]    s+(3C+4)t
#+END_EXAMPLE
