CS/os.html

<div id="outline-container-3-6-3" class="outline-4">
<h4 id="sec-3-6-3"><span class="section-number-4">3.6.3</span> Registers</h4>
<div class="outline-text-4" id="text-3-6-3">


<p class="verse">
%eax, %edx and %ecx are classified as caller-save registers.<br/>
callee can overwrite them without destroying any data required by P.<br/>
<br/>
%ebx, %esi and %edi : callee-save registers.<br/>
callee must save the values on the stack before overwriting them,<br/>
and restore them before returning.<br/>
Because caller may need them for its future computations.<br/>
</p>


</div>

</div>

<div id="outline-container-3-6-4" class="outline-4">
<h4 id="sec-3-6-4"><span class="section-number-4">3.6.4</span> Example</h4>
<div class="outline-text-4" id="text-3-6-4">




<pre class="src src-c++"><span style="color: #daa520;">int</span> <span style="color: #00008b; font-weight: bold;">swap_add</span>(<span style="color: #daa520;">int</span> *<span style="color: #008b8b;">xp</span>, <span style="color: #daa520;">int</span> *<span style="color: #008b8b;">yp</span>)
{
    <span style="color: #daa520;">int</span> <span style="color: #008b8b;">x</span> = *xp;
    <span style="color: #daa520;">int</span> <span style="color: #008b8b;">y</span> = *yp;

    *xp = y;
    *yp = x;
    <span style="color: #1e90ff; font-weight: bold;">return</span> x + y;
}

<span style="color: #daa520;">int</span> <span style="color: #00008b; font-weight: bold;">caller</span>()
{
    <span style="color: #daa520;">int</span> <span style="color: #008b8b;">arg1</span> = 534;
    <span style="color: #daa520;">int</span> <span style="color: #008b8b;">arg2</span> = 1057;
    <span style="color: #daa520;">int</span> <span style="color: #008b8b;">sum</span> = swap_add(&amp;arg1, &amp;arg2);
    <span style="color: #daa520;">int</span> <span style="color: #008b8b;">diff</span> = arg1 - arg2;

    <span style="color: #1e90ff; font-weight: bold;">return</span> sum * diff;
}
</pre>

<ul>
<li id="sec-3-6-4-1">Caller<br/>



<pre class="src src-asm"><span style="color: #00008b; font-weight: bold;">caller</span>:
    <span style="color: #1e90ff; font-weight: bold;">pushl</span> <span style="color: #008b8b;">%ebp</span>              <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Save old %ebp</span>
    <span style="color: #1e90ff; font-weight: bold;">movl</span> <span style="color: #008b8b;">%esp</span>, <span style="color: #008b8b;">%ebp</span>         <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Set %ebp as frame pointer</span>
    <span style="color: #1e90ff; font-weight: bold;">subl</span> $24, <span style="color: #008b8b;">%esp</span>          <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Allocate 24 bytes on stack</span>
    <span style="color: #1e90ff; font-weight: bold;">movl</span> $534, -4(<span style="color: #008b8b;">%ebp</span>)     <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Set arg1 to 534</span>
    <span style="color: #1e90ff; font-weight: bold;">movl</span> $1057, -8(<span style="color: #008b8b;">%ebp</span>)        <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Set arg2 to 1057</span>
    <span style="color: #1e90ff; font-weight: bold;">leal</span> -8(<span style="color: #008b8b;">%ebp</span>), <span style="color: #008b8b;">%eax</span>     <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Compute &amp;arg2</span>
    <span style="color: #1e90ff; font-weight: bold;">movl</span> <span style="color: #008b8b;">%eax</span>, 4(<span style="color: #008b8b;">%esp</span>)      <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Store on stack</span>
    <span style="color: #1e90ff; font-weight: bold;">leal</span> -4(<span style="color: #008b8b;">%ebp</span>), <span style="color: #008b8b;">%eax</span>         <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Compute &amp;arg1</span>
    <span style="color: #1e90ff; font-weight: bold;">movl</span> <span style="color: #008b8b;">%eax</span>, (<span style="color: #008b8b;">%esp</span>)       <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Store on stack</span>
    <span style="color: #1e90ff; font-weight: bold;">call</span> swap_add               <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Call the swap_add function</span>
    <span style="color: #1e90ff; font-weight: bold;">movl</span> -4(<span style="color: #008b8b;">%ebp</span>), <span style="color: #008b8b;">%edx</span>
    <span style="color: #1e90ff; font-weight: bold;">subl</span> -8(<span style="color: #008b8b;">%ebp</span>), <span style="color: #008b8b;">%edx</span>
    <span style="color: #1e90ff; font-weight: bold;">imull</span> <span style="color: #008b8b;">%edx</span>, <span style="color: #008b8b;">%eax</span>
    <span style="color: #1e90ff; font-weight: bold;">leave</span>
    <span style="color: #1e90ff; font-weight: bold;">ret</span> 
</pre>

<p>
Stack Frame:
</p><table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Saved %ebp(%ebp)</td></tr>
<tr><td class="left">arg1</td></tr>
<tr><td class="left">arg2</td></tr>
<tr><td class="left"><i>Unused</i></td></tr>
<tr><td class="left">&amp;arg2</td></tr>
<tr><td class="left">&amp;arg1 (%esp)</td></tr>
</tbody>
</table>

After call:
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<colgroup><col class="left" />
</colgroup>
<tbody>
<tr><td class="left">Saved %ebp</td></tr>
<tr><td class="left">arg1</td></tr>
<tr><td class="left">arg2</td></tr>
<tr><td class="left">/Unused</td></tr>
<tr><td class="left">&amp;arg2</td></tr>
<tr><td class="left">&amp;arg1</td></tr>
<tr><td class="left">Return address</td></tr>
<tr><td class="left">Saved %ebp(%ebp)</td></tr>
<tr><td class="left">Saved %ebx(%esp)</td></tr>
</tbody>
</table>

</li>
</ul>
<ul>
<li id="sec-3-6-4-2">Callee<br/>
<ul>
<li>setup
</li>
</ul>




<pre class="src src-asm"><span style="color: #00008b; font-weight: bold;">swap_add</span>:
    <span style="color: #1e90ff; font-weight: bold;">pushl</span> <span style="color: #008b8b;">%ebp</span>
    <span style="color: #1e90ff; font-weight: bold;">movl</span> <span style="color: #008b8b;">%esp</span>, <span style="color: #008b8b;">%ebp</span>
    <span style="color: #1e90ff; font-weight: bold;">pushl</span> <span style="color: #008b8b;">%ebx</span>          <span style="color: #8b8989;">//</span><span style="color: #8b8989;">for temporary storage</span>
</pre>

<ul>
<li>body
</li>
</ul>




<pre class="src src-asm"><span style="color: #00008b; font-weight: bold;">movl</span>    <span style="color: #1e90ff; font-weight: bold;">8</span>(<span style="color: #008b8b;">%ebp</span>), <span style="color: #008b8b;">%edx</span>   <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Get xp</span>
<span style="color: #00008b; font-weight: bold;">movl</span>    <span style="color: #1e90ff; font-weight: bold;">12</span>(<span style="color: #008b8b;">%ebp</span>), <span style="color: #008b8b;">%ecx</span>  <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Get yp</span>
<span style="color: #00008b; font-weight: bold;">movl</span>    (<span style="color: #008b8b;">%edx</span>), <span style="color: #008b8b;">%ebx</span>        <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Get x</span>
<span style="color: #00008b; font-weight: bold;">movl</span>    (<span style="color: #008b8b;">%ecx</span>), <span style="color: #008b8b;">%eax</span>        <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Get y</span>
<span style="color: #00008b; font-weight: bold;">movl</span>    <span style="color: #1e90ff; font-weight: bold;">%eax</span>, (<span style="color: #008b8b;">%edx</span>)        <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Store y at xp</span>
<span style="color: #00008b; font-weight: bold;">movl</span>    <span style="color: #1e90ff; font-weight: bold;">%ebx</span>, (<span style="color: #008b8b;">%ecx</span>)        <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Store x at yp</span>
<span style="color: #00008b; font-weight: bold;">addl</span>    <span style="color: #1e90ff; font-weight: bold;">%ebx</span>, <span style="color: #008b8b;">%eax</span>      <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Return value = x + y</span>
</pre>

<ul>
<li>finish
</li>
</ul>




<pre class="src src-asm"><span style="color: #00008b; font-weight: bold;">popl</span>    <span style="color: #1e90ff; font-weight: bold;">%ebx</span>        <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Restore %ebx</span>
<span style="color: #00008b; font-weight: bold;">popl</span>    <span style="color: #1e90ff; font-weight: bold;">%ebp</span>        <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Restore %ebp</span>
<span style="color: #00008b; font-weight: bold;">ret</span>                 <span style="color: #8b8989;">//</span><span style="color: #8b8989;">Return</span>
</pre>

</li>
</ul>
</div>
</div>

</div>

<div id="outline-container-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> Array Allocation</h3>
<div class="outline-text-3" id="text-3-7">

<ul>
<li>$$\&amp;A[i] = x_a + i\cdot sizeof(type)$$
</li>
<li>for an array declare as D[R][C], 
</li>
</ul>


$$\&D[i][j] = x_d + sizeof(type)\cdot (C\cdot i + j)$$

<pre class="example">s: start address  t: type size  declaration: A[R][C]
A[0]   A[0][0]    s
A[0]   A[0][1]    s+t
A[1]   A[1][0]    s+Ct
A[1]   A[1][2]    s+(C+2)t
A[3]   A[3][4]    s+(3C+4)t
</pre>

</div>
</div>
</div>
</div>

</body>
</html>
